package utils;

/**
 * @Description
 * @auther denny
 * @create 2019-12-10 14:50
 */
public class Test {
    public static void main(String[] args) {
        String s = "上海市,北京市,西安市,重庆市,苏州市,广州市,深圳市,杭州市,武汉市,成都市,石家庄市,天津市,宁波市,郑州市,合肥市,佛山市,南京市,无锡市,保定市,济南市,东莞市,长沙市,南昌市,大连市,长春市,邢台市,青岛市,乌鲁木齐市,沈阳市,邯郸市,太原市,临沂市,昆明市,贵阳市,洛阳市,南通市,厦门市,绍兴市,上饶市,阜阳市,徐州市,兰州市,潍坊市,济宁市,信阳市,菏泽市,淄博市,德州市,南阳市,台州市,常州市,盐城市,福州市,驻马店市,唐山市,廊坊市,荆州市,金华市,渭南市,泰州市,威海市,聊城市,安庆市,张家口市,遵义市,九江市,宜春市,新乡市,平顶山市,宜昌市,温州市,嘉兴市,中山市,榆林市,南宁市,临汾市,滁州市,衡水市,沧州市,湖州市,赣州市,商丘市,黄冈市,宝鸡市,银川市,哈尔滨市,包头市,吕梁市,吉林市,东营市,滨州市,宿州市,连云港市,吉安市,蚌埠市,周口市,绵阳市,咸阳市,海口市,长治市,忻州市,运城市,衡阳市,株洲市,枣庄市,泰安市,亳州市,焦作市,许昌市,秦皇岛市,孝感市,泸州市,镇江市,宿迁市,延安市,宣城市,芜湖市,淮南市,濮阳市,惠州市,汉中市,呼和浩特市,赤峰市,泉州市,朔州市,晋中市,烟台市,日照市,六安市,安阳市,承德市,襄阳市,十堰市,衢州市,扬州市,淮安市,汕头市,江门市,湛江市,西宁市,天水市,抚州市,娄底市,开封市,黄石市,商洛市,安康市,鄂尔多斯市,岳阳市,郴州市,常德市,马鞍山市,丽水市,乌兰察布市,定西市,白银市,铜仁市,大同市,湘潭市,邵阳市,淮北市,荆门市,南充市,舟山市,茂名市,四平市,咸宁市,眉山市,乐山市,三亚市,柳州市,张掖市,武威市,平凉市,三明市,安顺市,新余市,锦州市,丹东市,鞍山市,池州市,黄山市,漯河市,三门峡市,随州市,鄂州市,攀枝花市,宜宾市,德阳市,巴中市,珠海市,梅州市,石嘴山市,固原市,巴彦淖尔市,贵港市,酒泉市,六盘水市,通化市,松原市,萍乡市,铜陵市,鹤壁市,自贡市,达州市,中卫市,吴忠市,鸡西市,乌海市,桂林市,昭通市,玉溪市,阳泉市,库尔勒市,石河子市,辽源市,白山市,白城市,鹰潭市,景德镇市,抚顺市,本溪市,盘锦市,长沙市,张家界市,广元市,遂宁市,江阴市,肇庆市,揭阳市,拉萨市,大庆市,通辽市,保山市,克拉玛依市,昌吉市,营口市,葫芦岛市,青岛市,天门市,潜江市,资阳市,宜兴市,清远市,河源市,东莞市,齐齐哈尔市,呼伦贝尔市,漳州市,贵阳市,永州市,怀化市,石家庄市,沧州市,仙桃市,恩施市,余姚市,苏州市,潮州市,儋州市,双鸭山市,七台河市,鹤岗市,佳木斯市,锡林浩特市,满洲里市,梧州市,钦州市,北海市,兰州市,嘉峪关市,石狮市,莆田市,龙岩市,兴义市,遵义市,曲靖市,丽江市,安宁市,长治市,运城市,五家渠市,奎屯市,哈密市,伊宁市,阿克苏市,长春市,延吉市,庄河市,辽阳市,阜新市,朝阳市,娄底市,吉首市,邹城市,荣成市,龙口市,莱芜市,胶州市,寿光市,济南市,阜阳市,巢湖市,禹州市,驻马店市,河间市,邯郸市,钟祥市,武汉市,松滋市,当阳市,赤壁市,西昌市,内江市,绵阳市,广安市,永康市,嵊州市,瑞安市,临海市,东阳市,慈溪市,诸暨市,义乌市,乐清市,海宁市,奉化市,兴化市,如皋市,邳州市,靖江市,海门市,高邮市,常熟市,扬中市,泰兴市,启东市,溧阳市,丹阳市,吴川市,清远市,普宁市,高州市,云浮市,阳江市,台山市,韶关市,开平市,鹤山市,重庆市,林芝市,万宁市,琼海市,银川市,吴忠市,伊春市,哈尔滨市,玉林市,南宁市,来宾市,贺州市,张掖市,庆阳市,临夏市,石狮市,厦门市,宁德市,南平市,龙海市,晋江市,福清市,凯里市,都匀市,文山市,腾冲市,普洱市,弥勒市,蒙自市,临沧市,景洪市,个旧市,大理市,大理白族自治州大理市,楚雄自治州楚雄市,阳泉市,临汾市,晋中市,乌鲁木齐市,吐鲁番市,塔城市,喀什市,博乐市,梅河口市,吉林松原市,珲春市,敦化市,樟树市,瓦房店市,铁岭市,凌源市,开原市,锦州市,东港市,大石桥市,岳阳市,益阳市,益阳市,湘乡市,邵阳市,汨罗市,浏阳市,醴陵市,耒阳市,怀化市,诸城市,章丘市,滕州市,平度市,蓬莱市,临沂市,莱州市,莱阳市,莱西市,莱芜市,济宁市,济宁市,高密市,天长市,宁国市,六安市,界首市,长葛市,偃师市,许昌市,新郑市,新乡市,汝州市,沁阳市,南阳市,洛阳市,涿州市,张家口市,邢台市,辛集市,武安市,任丘市,秦皇岛市,迁安市,黄骅市,定州市,枝江市,枣阳市,宜都市,石首市,麻城市,利川市,老河口市,黄冈市,洪湖市,汉川市,大冶市,安陆市,雅安市,遂宁市,彭州市,内江市,阆中市,江油市,广元市,广汉市,广安市,都江堰市,义乌市,桐乡市,宁波市,兰溪市,江山市,仪征市,扬州市,盐城市,新沂市,无锡市,太仓市,启东市,句容市,东台市,丹阳市,阳春市,兴宁市,信宜市,四会市,汕头市,佛山市,汉中市,韩城市";
        String s1 = s.substring(0, 500);
        System.out.println(s1);
        System.out.println(s1.length());
    }
}
